app/views/schools/show.html.erb

SELECT "students".* FROM "students" WHERE "students"."school_id" = ?  [["school_id", 26]]
---
<ul>
<% @school.students.each do |student| %>