app/controllers/schools_controller.rb

SELECT "schools".* FROM "schools"
---
  def index
    @schools = School.all

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
  def show
    @school = School.find(params[:id])

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
---
  def search
    school = School.find(params[:id]) #tells you which school you're in