app/controllers/students_controller.rb

  def index
    @students = Student.all
---
SELECT "students".* FROM "students" WHERE (name LIKE '%params[:search]%')

  def edit
    @student = Student.find(params[:id])
    @schools = School.all
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "schools".* FROM "schools"

  def new
    @student = Student.new #HTTP is stateless. Dumps out what was around before
    @schools = School.all
---
SELECT "schools".* FROM "schools"

  def create
    student = Student.create(student_params)
---
INSERT INTO "students" ("name", "age", "created_at", "updated_at", "school_id") VALUES (?, ?, ?, ?, ?)  [["name", "Matt"], ["age", 26], ["created_at", "2019-08-30 18:03:49.876534"], ["updated_at", "2019-08-30 18:03:49.876534"], ["school_id", 26]]

  def update
    student = Student.find(params[:id])
    student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "age" = ?, "school_id" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["age", 62], ["school_id", 28], ["updated_at", "2019-08-30 17:56:29.721720"], ["id", 3]]

  def destroy
    student = Student.find(params[:id])
    student.destroy
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 4]]